import Head from 'next/head'
import Link from 'next/link'
import Footer from '../components/shared/Footer'
import Header from '../components/shared/PageHeader'
import Styles from '../styles/faq.module.scss'

const faq = () => {
  return (
    <div>
      <Head>
        <title>سوالات متداول</title>
        <meta name='description' content='صفحه سوالات متداول' />
      </Head>

      <Header />
      <main className='main'>
        <div className='page-title'>
          <h2>سوالات متداول</h2>
        </div>
        <div className='content-box'>
          <h4>جدول سوالات</h4>
          <div className={Styles.faq}>
            <ol>
              <li>
                <Link href='#faq-1' passHref scroll={false}>
                  <a>لینک</a>
                </Link>
                <ol>
                  <li>
                    <Link href='#faq-1-1' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#faq-1-2' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#faq-1-3' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                </ol>
              </li>
              <li>
                <Link href='#faq-2' passHref scroll={false}>
                  <a>لینک</a>
                </Link>
                <ol>
                  <li>
                    <Link href='#faq-2-1' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#faq-2-2' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#faq-2-3' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                </ol>
              </li>
              <li>
                <Link href='#paraph' passHref scroll={false}>
                  <a>لینک</a>
                </Link>
                <ol>
                  <li>
                    <Link href='#paraph' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#paraph' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                  <li>
                    <Link href='#paraph' passHref scroll={false}>
                      <a>لینک</a>
                    </Link>
                  </li>
                </ol>
              </li>
            </ol>
          </div>
          <div className={Styles.faq_content}>
            <ol>
              <li>
                <h4 id='faq-1'>عنوان تستی</h4>
                <ol>
                  <li>
                    <h5 id='faq-1-1'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                  <li>
                    <h5 id='faq-1-2'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                  <li>
                    <h5 id='faq-1-3'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                </ol>
              </li>
              <li>
                <h4 id='faq-2'>عنوان تستی</h4>
                <ol>
                  <li>
                    <h5 id='faq-2-1'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                  <li>
                    <h5 id='faq-2-2'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                  <li>
                    <h5 id='faq-2-3'>عنوان تستی</h5>
                    <p>
                      لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ،
                      و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                      روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای
                      شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
                      بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
                      درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می
                      طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
                      ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی
                      ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
                      موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و
                      زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                      سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.
                    </p>
                  </li>
                </ol>
              </li>
            </ol>
          </div>
        </div>
      </main>

      <Footer />
    </div>
  )
}

export default faq
